digraph grafo_output { x [label="root = x ; |E'|-|E| = 2"];
x->z [style=dashed];
z [label="d(x,z)=1"]; 
x->a [style=dashed, color=red];
a [label="d(x,a)=1"]; 
x->c [style=dashed, color=red];
c [label="d(x,c)=1"]; 
z->b [style=dashed];
b [label="d(x,b)=2"]; 
a->f [style=dashed];
f [label="d(x,f)=2"]; 
c->f;
f->b;
 }
